Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОборотыПоТоварам.Записывать = Истина;
    
    Для Каждого ТекСтрока Из Товары Цикл
        ДвижениеОстаток = Движения.ОстаткиТоваров.Добавить();
        ДвижениеОстаток.ВидДвижения = ВидДвиженияНакопления.Расход;
        ДвижениеОстаток.Период = Дата;
        ДвижениеОстаток.Товар = ТекСтрока.Товар;
        ДвижениеОстаток.Количество = ТекСтрока.Количество;
		
		ДвижениеОборот = Движения.ОборотыПоТоварам.Добавить();
		ДвижениеОборот.Период = Дата;
		ДвижениеОборот.Товар = ТекСтрока.Товар;
		ДвижениеОборот.Количество = ТекСтрока.Количество;
		ДвижениеОборот.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
    КонецЦикла;
КонецПроцедуры